app/controllers/api/populate_conversations_controller.rb

  def populate
    closed_conversations_list = get_closed_conversations_list
    conversation_counter = 0
    closed_conversations_list.each do |conversation_id|
      unless conversation_exist? (conversation_id)
        conversation = get_conversation_from_intercom(conversation_id)
        @conversation = Conversation.create(conversation_id: conversation_id)
---
INSERT INTO "conversations" ("conversation_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["conversation_id", 20176932854], ["created_at", "2018-12-26 12:15:07.095473"], ["updated_at", "2018-12-26 12:15:07.095473"]]

def find_or_create_author(author_id, conversation_part)
  if author_exist?(author_id)
    @author = Author.find_by_author_id(author_id)
  else
    author_obj = get_author_from_conversation_part(conversation_part)
    @author = Author.create(author_id: author_obj[:author_id], author_type: author_obj[:author_type], name: author_obj[:name], image_url: author_obj[:image_url])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."author_id" = ? LIMIT ?  [["author_id", "5c223e4e452d3ca20b58c9c6"], ["LIMIT", 1]]
INSERT INTO "authors" ("author_type", "author_id", "image_url") VALUES (?, ?, ?)  [["author_type", "contact"], ["author_id", "5c223e4e452d3ca20b58c9c6"], ["image_url", "https://static.intercomassets.com/app/pseudonym_avatars_2018/turquoise-ghost.png"]]