app/views/conversations/_conversations.html.erb

              </li>
              <% obj[:tags].each do |tag| %>
---
SELECT `tags`.* FROM `tags`


  <% obj[:conversations].each do |conversation| %>
    <% unless conversation.nil? || conversation.conversation_parts.empty? %>
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."conversation_id" = ? LIMIT ?  [["conversation_id", 16063250329], ["LIMIT", 1]]
SELECT  "conversation_parts".* FROM "conversation_parts" WHERE "conversation_parts"."conversation_id" = ? ORDER BY "conversation_parts"."id" ASC LIMIT ?  [["conversation_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "conversation_parts" WHERE "conversation_parts"."conversation_id" = ? LIMIT ?  [["conversation_id", 4], ["LIMIT", 1]]

          <% if obj[:highlights].empty? || obj[:highlights].present? && obj[:highlights][conversation].empty? %>
            <p class="card-text text-left card-margin"><%== Rails::Html::FullSanitizer.new.sanitize(conversation.conversation_parts.first.conversation_part_body) %></p>
---
SELECT  "conversations".* FROM "conversations" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

            <small>Created
              by: <%= conversation.conversation_parts.first.author.name if conversation.conversation_parts.first.author.present? %>
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          </div>
          <% unless conversation.tags.empty? %>
---
SELECT  1 AS one FROM "tags" INNER JOIN "conversation_tags" ON "tags"."id" = "conversation_tags"."tag_id" WHERE "conversation_tags"."conversation_id" = ? LIMIT ?  [["conversation_id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "conversation_tags" ON "tags"."id" = "conversation_tags"."tag_id" WHERE "conversation_tags"."conversation_id" = ?  [["conversation_id", 83]]