app/views/conversations/show.html.erb

    <div class="card-block">
      <% @conversation.conversation_parts.each do |conversation_part| %>
---
SELECT "conversation_parts".* FROM "conversation_parts" WHERE "conversation_parts"."conversation_id" = ?  [["conversation_id", 1]]