app/controllers/conversations_controller.rb

  def search
    @conversations = []
    @conversation_highlights = {}
    keyword = remove_conjunctions_and_articles(params[:keyword])
    @tag_filter = params[:tag_filter]

    if keyword.blank?
      @conversations = Conversation.all
      flash.now[:danger] = "You didn't enter any keyword"
    else
      if get_keyword_count(keyword) == 1
        @search_result_and = conversation_part_search(keyword, AND)
        @search_result_or = @search_result_and
      else
        @search_result_and = conversation_part_search(keyword, AND)
        @search_result_or = conversation_part_search(keyword, OR)
      end
      @conversation_parts = @search_result_and.any? ? @search_result_and : @search_result_or
      @conversation_parts.with_highlights.each do |conversation_part, highlights|
        highlights_body = highlights[:sanitized_conversation_part_body]
        if get_matching_score(highlights_body, keyword) >= MINIMUM_MATCHING_SCORE
          conversation = conversation_part.conversation
          if @tag_filter == ALL
            @conversations << conversation unless @conversations.include?(conversation)
          else
            @conversations << conversation unless @conversations.include?(conversation) ||
                conversation.tags.include?(Tag.find_by_name(@tag_filter)) == false
---
SELECT  1 AS one FROM "tags" INNER JOIN "conversation_tags" ON "tags"."id" = "conversation_tags"."tag_id" WHERE "conversation_tags"."conversation_id" = ? LIMIT ?  [["conversation_id", 4], ["LIMIT", 1]]

      end
    end
    @conversations = @conversations.paginate(page: params[:page], per_page: 10)
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def index
    @conversations = Conversation.all
    @conversation_highlights = {}
    @conversations = @conversations.paginate(page: params[:page], per_page: 10)
    @tags = Tag.all
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."conversation_id" = ? LIMIT ?  [["conversation_id", 16063250329], ["LIMIT", 1]]
SELECT  "conversations".* FROM "conversations" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "conversations"
SELECT `tags`.* FROM `tags`

  def show
    @conversation = Conversation.find(params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."conversation_id" = ? LIMIT ?  [["conversation_id", 17811524043], ["LIMIT", 1]]

  def get_conversation
    if conversations_params[:item][:type] == CONVERSATION
      conversation_id = conversations_params[:item][:id]
      @conversation = Conversation.new(conversation_id: conversation_id)
      @conversation.save
---
INSERT INTO "conversations" ("conversation_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["conversation_id", 20065276045], ["created_at", "2018-12-24 11:31:49.882359"], ["updated_at", "2018-12-24 11:31:49.882359"]]

  def find_or_create_author(author_id, conversation_part)
    if author_exist?(author_id)
      @author = Author.find_by_author_id(author_id)
    else
      author_obj = get_author_from_conversation_part(conversation_part)
      @author = Author.create(author_id: author_obj[:author_id], author_type: author_obj[:author_type], name: author_obj[:name], image_url: author_obj[:image_url])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."author_id" = ? LIMIT ?  [["author_id", "5c17971cebe40402c0c00676"], ["LIMIT", 1]]
INSERT INTO "authors" ("author_type", "author_id", "name", "image_url") VALUES (?, ?, ?, ?)  [["author_type", "user"], ["author_id", "5a65f2a87433e1e58e901823"], ["name", "Intercom Test"], ["image_url", "https://www.joyoushealth.com/medialib/img-95-home.jpg"]]